twoisforjoy/app/controllers/api/v1/users_controller.rb

  def show
    render json: { user: User.find(params[:id]) }
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1