twoisforjoy/app/models/user.rb

  def self.valid_login?(email, password)
    user = User.find_by(email: email)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'test@example.com' LIMIT 1

  def self.with_unexpired_token(token, period)
    where(token: token).where('token_created_at >= ?', period).first
---
SELECT  `users`.* FROM `users` WHERE `users`.`token` = 'XCmZvFydCfYt8q2JKKiWhJKJ' AND (token_created_at >= '2018-04-19 16:36:00.393355') ORDER BY `users`.`id` ASC LIMIT 1

    def invalidate_token
      self.update_columns(token: nil)
---
UPDATE `users` SET `updated_at` = '2018-04-19 17:06:00', `token_created_at` = '2018-04-19 17:06:00' WHERE `users`.`id` = 1